Revit 2026 API

# DisplacementElementSetDisplacedElementIds Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetDisplacedElementIds(
	ICollection<ElementId> displacedElemIds
)
```
```vb
Public Sub SetDisplacedElementIds (
	displacedElemIds As ICollection(Of ElementId)
)
```
```cpp
public:
void SetDisplacedElementIds(
	ICollection<ElementId^>^ displacedElemIds
)
```
```fsharp
member SetDisplacedElementIds :
        displacedElemIds : ICollection<ElementId> -> unit
```

#### Parameters

displacedElemIds ICollectionElementId

#### Reference

DisplacementElement Class

Autodesk.Revit.DB Namespace